In [3]:
import numpy as np
import pandas as pd

In [14]:
labels = ["a","b","c"]
np_arr = np.arange(5)
my_data = [10,20,30]
d = {"a":10, "b":20, "c":30}

In [10]:
pd.Series(data=np_arr)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [11]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(np_arr)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [16]:
#Series from Dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [28]:
s1 = pd.Series([200,245,294,210], ["India", "USA", "France", "Germany"])
print(s1)

India      200
USA        245
France     294
Germany    210
dtype: int64

In [29]:
s1.USA

245

In [30]:
s1["USA"]

245

## Dataframe Basics

In [266]:
df = pd.DataFrame(np.random.randn(5,4), columns=["Col1","Col2", "Col3","Col4"])
print(df)

       Col1      Col2      Col3      Col4
0 -0.139900 -0.922985 -0.693275 -1.787525
1  0.005244 -0.082221  1.485498 -0.265924
2  0.115136  1.317476  1.155060 -0.150374
3 -0.347307 -1.543825  1.873110  1.133516
4 -2.177368  0.200996 -0.304201 -0.714106

In [267]:
df.Col1

0   -0.139900
1    0.005244
2    0.115136
3   -0.347307
4   -2.177368
Name: Col1, dtype: float64

In [268]:
type(df.Col1)

pandas.core.series.Series

In [269]:
#Get a new datframe with only two columns
df[["Col1","Col2"]]

       Col1      Col2
0 -0.139900 -0.922985
1  0.005244 -0.082221
2  0.115136  1.317476
3 -0.347307 -1.543825
4 -2.177368  0.200996

In [270]:
#Add a new column
df["new"] = np.random.randn(5)
df

       Col1      Col2      Col3      Col4       new
0 -0.139900 -0.922985 -0.693275 -1.787525 -1.028265
1  0.005244 -0.082221  1.485498 -0.265924 -1.404107
2  0.115136  1.317476  1.155060 -0.150374 -3.127944
3 -0.347307 -1.543825  1.873110  1.133516  0.349732
4 -2.177368  0.200996 -0.304201 -0.714106 -0.333049

In [271]:
#axis 1 suggest that to search it in columns
df.drop("new", axis=1)
df

       Col1      Col2      Col3      Col4       new
0 -0.139900 -0.922985 -0.693275 -1.787525 -1.028265
1  0.005244 -0.082221  1.485498 -0.265924 -1.404107
2  0.115136  1.317476  1.155060 -0.150374 -3.127944
3 -0.347307 -1.543825  1.873110  1.133516  0.349732
4 -2.177368  0.200996 -0.304201 -0.714106 -0.333049

In [272]:
#axis 1 suggest that to search it in columns
# adding inplace arg to make our changes stay 
df.drop("new", axis=1, inplace=True)
df

       Col1      Col2      Col3      Col4
0 -0.139900 -0.922985 -0.693275 -1.787525
1  0.005244 -0.082221  1.485498 -0.265924
2  0.115136  1.317476  1.155060 -0.150374
3 -0.347307 -1.543825  1.873110  1.133516
4 -2.177368  0.200996 -0.304201 -0.714106

In [273]:
#Drop rows
df.drop(4, axis=0)

       Col1      Col2      Col3      Col4
0 -0.139900 -0.922985 -0.693275 -1.787525
1  0.005244 -0.082221  1.485498 -0.265924
2  0.115136  1.317476  1.155060 -0.150374
3 -0.347307 -1.543825  1.873110  1.133516

In [274]:
#Finding data
df.loc[0]

Col1   -0.139900
Col2   -0.922985
Col3   -0.693275
Col4   -1.787525
Name: 0, dtype: float64

In [275]:
##get the first row with index 0 and only first three columns
df.iloc[0,0:3]

Col1   -0.139900
Col2   -0.922985
Col3   -0.693275
Name: 0, dtype: float64

In [276]:
#get the second row with index 1 and only three columns
df.loc[1,["Col1","Col2","Col3"]]

Col1    0.005244
Col2   -0.082221
Col3    1.485498
Name: 1, dtype: float64

In [277]:
df.loc[[0,1],["Col1","Col2","Col3"]]

       Col1      Col2      Col3
0 -0.139900 -0.922985 -0.693275
1  0.005244 -0.082221  1.485498

In [15]:
df = pd.DataFrame(np.random.randint(1,1509, 20).reshape(5,4), columns=["Col1","Col2", "Col3","Col4"])
df

   Col1  Col2  Col3  Col4
0   375  1241   641   792
1  1328   991   950   898
2   408   441   343  1070
3   535     2   921   861
4  1200     3   467   402

In [16]:
df["countries"] = ["USA","UK","GER","IND","AUS"]

In [17]:
# df.reset_index(inplace=True)
df.set_index("countries", inplace=True)
df

           Col1  Col2  Col3  Col4
countries
USA         375  1241   641   792
UK         1328   991   950   898
GER         408   441   343  1070
IND         535     2   921   861
AUS        1200     3   467   402

In [23]:
df[df>400]

             Col1    Col2   Col3  Col4
countries
USA           NaN  1241.0  641.0   792
UK         1328.0   991.0  950.0   898
GER         408.0   441.0    NaN  1070
IND         535.0     NaN  921.0   861
AUS        1200.0     NaN  467.0   402

In [24]:
df[df.Col1 > 400 and df.Col2 >2]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

## MultiIndexing

In [278]:
#MultiIndex
grade = ["G1","G2","G2","G1","G2"]
sal = [2,5,6,3,1]
hier_index=  list(zip(grade, sal))
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3, 5, 6]],
           codes=[[0, 1, 1, 0, 1], [1, 3, 4, 2, 0]])

In [279]:
df = pd.DataFrame(np.random.randn(5,2), index =hier_index, columns= ["Col1","Col2"])

In [280]:
df

          Col1      Col2
G1 2  1.194120 -0.716459
G2 5 -1.004857 -0.024092
   6  1.450008  0.494890
G1 3  0.419518 -0.845404
G2 1  0.119281 -1.882391

In [281]:
df.loc["G1"].loc[2]

Col1    1.194120
Col2   -0.716459
Name: 2, dtype: float64

In [282]:
df.index.names = ["Grade", "Salary"]

In [283]:
df

                  Col1      Col2
Grade Salary
G1    2       1.194120 -0.716459
G2    5      -1.004857 -0.024092
      6       1.450008  0.494890
G1    3       0.419518 -0.845404
G2    1       0.119281 -1.882391

In [284]:
df.xs("G2")

            Col1      Col2
Salary
5      -1.004857 -0.024092
6       1.450008  0.494890
1       0.119281 -1.882391

In [285]:
df.xs(1,level="Salary")

           Col1      Col2
Grade
G2     0.119281 -1.882391

## Handling missing data

In [286]:
df =  pd.DataFrame(data  = {"Col1":[np.nan,56,98], 
                            "Col2":[np.nan, np.nan,32],
                            "Col3":[98,65,56]})

In [287]:
df

   Col1  Col2  Col3
0   NaN   NaN    98
1  56.0   NaN    65
2  98.0  32.0    56

In [288]:
#drops any column with one or more null values 
# use inplace to make changes to the original df
df.dropna()

   Col1  Col2  Col3
2  98.0  32.0    56

In [289]:
#drops any column with one or more null values 
# use inplace to make changes to the original df
df.dropna(axis=1)

   Col3
0    98
1    65
2    56

In [290]:
#Use threshold  to Require that many non-NA values.
# Simply it means that drop rows where there are >=2 null values in a row
df.dropna(thresh=2)

   Col1  Col2  Col3
1  56.0   NaN    65
2  98.0  32.0    56

In [291]:
#filling the null values
print(df.fillna(value=-1, axis=1))

   Col1  Col2  Col3
0  -1.0  -1.0    98
1  56.0  -1.0    65
2  98.0  32.0    56

In [292]:
# different types of filling techniques
print("Original Df")
print(df)
print("\nBackward Fill (Column wise)")
print(df.bfill(axis=1))
print("\nForward Fill (Column wise)")
print(df.ffill(axis=1))
print("\nFilling with a limit (Column wise)")
print (df.bfill(limit=1, axis=1))

Original Df
   Col1  Col2  Col3
0   NaN   NaN    98
1  56.0   NaN    65
2  98.0  32.0    56

Backward Fill (Column wise)
   Col1  Col2  Col3
0  98.0  98.0  98.0
1  56.0  65.0  65.0
2  98.0  32.0  56.0

Forward Fill (Column wise)
   Col1  Col2  Col3
0   NaN   NaN  98.0
1  56.0  56.0  65.0
2  98.0  32.0  56.0

Filling with a limit (Column wise)
   Col1  Col2  Col3
0   NaN  98.0  98.0
1  56.0  65.0  65.0
2  98.0  32.0  56.0

In [293]:
#filling with different values
df.Col1.fillna(value =df.Col1.mean())

0    77.0
1    56.0
2    98.0
Name: Col1, dtype: float64

## GroupBy

In [294]:
data = {"Company":["GOOG", "GOOG", "MSFT", "FB", "FB", "MSFT"],
       "Person":["S", "C", "A", "V", "C", "B"],
       "Sales":[200,120,340,124,125,602]}

df = pd.DataFrame(data=data)
df

  Company Person  Sales
0    GOOG      S    200
1    GOOG      C    120
2    MSFT      A    340
3      FB      V    124
4      FB      C    125
5    MSFT      B    602

In [295]:
df.groupby("Company").mean()

         Sales
Company
FB       124.5
GOOG     160.0
MSFT     471.0

In [296]:
df.groupby("Company").sum()

         Sales
Company
FB         249
GOOG       320
MSFT       942

In [297]:
df.groupby("Company").std()

              Sales
Company
FB         0.707107
GOOG      56.568542
MSFT     185.261977

In [298]:
df.groupby("Company").sum().loc["FB"]

Sales    249
Name: FB, dtype: int64

In [299]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [300]:
df.groupby("Company").max()

        Person  Sales
Company
FB           V    125
GOOG         S    200
MSFT         B    602

In [301]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  124.5    0.707107  124.0  124.25  124.5  124.75  125.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  471.0  185.261977  340.0  405.50  471.0  536.50  602.0

In [302]:
x = df.groupby("Company")

In [303]:
#This gives the difference with previous rows
x.diff()

   Sales
0    NaN
1  -80.0
2    NaN
3    NaN
4    1.0
5  262.0

## Merging and Joining

## Operations

In [304]:
np.random.seed(568)
df = pd.DataFrame(np.random.randint(1,20, 20).reshape(5,4), columns=["Col1","Col2", "Col3","Col4"])
df["Names"] = ["Cathy", "John", "Bruno", "Calvin", "Sara"]
df

   Col1  Col2  Col3  Col4   Names
0     7     2    18    12   Cathy
1     1    16     1    13    John
2     7     8    19    19   Bruno
3    19    11     7    16  Calvin
4    17     3     9     2    Sara

In [305]:
#Apply is one of the most strongest and valuable function on df
df.Col1.apply(lambda x: x*2)

0    14
1     2
2    14
3    38
4    34
Name: Col1, dtype: int64

In [306]:
df.iloc[1,:4].apply(lambda x: x/2)

Col1    0.5
Col2    8.0
Col3    0.5
Col4    6.5
Name: 1, dtype: float64

In [307]:
df["len_of_names"] = df.Names.apply(len)

In [308]:
df

   Col1  Col2  Col3  Col4   Names  len_of_names
0     7     2    18    12   Cathy             5
1     1    16     1    13    John             4
2     7     8    19    19   Bruno             5
3    19    11     7    16  Calvin             6
4    17     3     9     2    Sara             4

In [309]:
df["Col1*Col2"] = df.Col1 * df.Col2

In [310]:
df

   Col1  Col2  Col3  Col4   Names  len_of_names  Col1*Col2
0     7     2    18    12   Cathy             5         14
1     1    16     1    13    John             4         16
2     7     8    19    19   Bruno             5         56
3    19    11     7    16  Calvin             6        209
4    17     3     9     2    Sara             4         51

In [311]:
#get names of a columns
df.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Names', 'len_of_names', 'Col1*Col2'], dtype='object')

In [312]:
#Get only the columns specified by using names
new_df= df[["Col1", "Col2","Col3", "Col4"]]
new_df

   Col1  Col2  Col3  Col4
0     7     2    18    12
1     1    16     1    13
2     7     8    19    19
3    19    11     7    16
4    17     3     9     2

In [313]:
#Sorting columns
new_df.sort_values(by="Col2")

   Col1  Col2  Col3  Col4
0     7     2    18    12
4    17     3     9     2
2     7     8    19    19
3    19    11     7    16
1     1    16     1    13

In [314]:
new_df.isnull()

    Col1   Col2   Col3   Col4
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False

In [315]:
## ADD pivoting examples